tsung_things/oldattempts/20191118-0018 t2.large/simple.xml
<?xml version="1.0"?><tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="pmta.m7vvpmgtfq.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="2" unit="minute">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="10" unit="second"/>
    </arrivalphase>
    <user session="recommendee" start_time="5" unit="second"/>
    <user session="recommender" start_time="10" unit="second"/>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="recommendee" probability="50" type="ts_http">
      <request> <http url="/dummypath/create" method="GET"/> </request>
      <request> <http url="/home/recommendee" method="GET"/> </request>
      <request> <http url="/home/" method="GET"/> </request>
      <thinktime value="100" random="false"/>
      <request> <http url="/home/recommendee" method="GET"/> </request>
      <request> <http url="/home/feedback?verdict=2" method="GET"/> </request>
    </session>
    <session name="recommender" probability="50" type="ts_http">
      <request> <http url="/dummypath/create" method="GET"/> </request>
      <thinktime value="30" random="false"/>
      <request> <http url="/home/recommend" method="GET"/> </request>
      <request> <http url="/home/recommend?song_url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DeXBu09fwe3I&amp;commit=Submit" version="1.1" method="GET"/> </request>
    </session>
  </sessions>
</tsung>